OpenFoam/verification/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    Inlet        { type calculated; value uniform 101325; }
    Outlet       { type calculated; value uniform 101325; }
   ".*wall"      { type calculated; value uniform 101325; }
   "symmetry.*"  { type symmetry; }
}
