OpenFoam/verification/system/controlDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       buoyantSimpleFoam;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           10000;

deltaT            1;

writeControl      timeStep;

writeInterval     1000;

purgeWrite        1;

writeFormat       ascii;

writePrecision    8;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

libs 
( 
	"OutletPressurelib.so"
	"radiatingWall.so"
);
// ************************************************************************* //
