OpenFoam/verification/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes           { default steadyState; }

interpolationSchemes { default upwind phi; } //default linear; }

gradSchemes          { default Gauss upwind phi; } //default Gauss linear; }

snGradSchemes        { default uncorrected; }

laplacianSchemes     { default Gauss linear corrected; }

divSchemes           
{ 
    default bounded Gauss upwind;;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}





// ************************************************************************* //
